       *>---- hellonew.cob ----------------
       *> Sample GnuCOBOL program
       identification division.
       program-id. hello.
       procedure division.
       display
       "Hello, new world!"
       end-display 
       STOP RUN.
       *>----------------------------------