       IDENTIFICATION DIVISION.
       PROGRAM-ID. GET_NEXT_PIECE.
       
       DATA DIVISION.
       LINKAGE SECTION.
       
       01  LS-NEXT-PIECE  PIC 9(1).

       PROCEDURE DIVISION USING LS-NEXT-PIECE.

       COMPUTE LS-NEXT-PIECE = FUNCTION RANDOM * 7 + 1.

       END PROGRAM GET_NEXT_PIECE.

